[
  {
    "id": "walker-incident",
    "event_id": "2c3d4e5f-6a7b-48c9-d0e1-f2a3b4c5d6e7",
    "event_type": "SHOT",
    "event_level": "PRIMARY",
    "event_hierarchy": "CATEGORY_1",
    "icon": "gps_fixed",
    "label": "April 10, 1963 · Dallas, TX",
    "title": "The Walker Incident",
    "location": "4011 Turtle Creek Blvd, Dallas, TX",
    "description": "An assassination attempt is made on General Edwin Walker at his home. A bullet is fired through his window, narrowly missing him. The Warren Commission later concluded Lee Harvey Oswald was the shooter.",
    "context": "General Edwin Walker, a controversial right-wing political figure, was the target of an assassination attempt at his Dallas home. A single shot was fired through a window while Walker sat at his desk. The bullet narrowly missed him, deflected by the window frame. Initially unsolved, the case was later connected to Lee Harvey Oswald based on testimony from his wife Marina and physical evidence.",
    "featured": true,
    "start_ts": "1963-04-10T21:00:00Z",
    "time_precision": "APPROX"
  },
  {
    "id": "jfk-assassination",
    "event_id": "jfk-uuid-1963-11-22",
    "event_type": "SHOT",
    "event_level": "PRIMARY",
    "event_hierarchy": "CATEGORY_1",
    "icon": "gps_fixed",
    "label": "11/22/63 · Dallas, TX",
    "title": "JFK Assassination",
    "location": "Dealey Plaza, Dallas, TX",
    "description": "President John F. Kennedy assassinated in Dealey Plaza by Lee Harvey Oswald",
    "context": "President Kennedy was assassinated while riding in a motorcade through Dealey Plaza in Dallas, Texas. The Warren Commission concluded that Lee Harvey Oswald, acting alone, fired three shots from the Texas School Book Depository building, killing the President and wounding Governor John Connally.",
    "featured": true,
    "start_ts": "1963-11-22T12:30:00Z",
    "time_precision": "EXACT"
  },
  {
    "id": "tippit-murder",
    "event_id": "tippit-uuid-1963-11-22",
    "event_type": "SHOT",
    "event_level": "PRIMARY",
    "event_hierarchy": "CATEGORY_1",
    "icon": "gps_fixed",
    "label": "11/22/63 · Oak Cliff, Dallas, TX",
    "title": "Officer Tippit Murder",
    "location": "10th & Patton Streets, Oak Cliff, Dallas, TX",
    "description": "Lee Harvey Oswald murders Dallas Police Officer J.D. Tippit during manhunt",
    "context": "Approximately 45 minutes after the JFK assassination, Officer J.D. Tippit was shot and killed in Oak Cliff. Multiple witnesses identified Oswald as the shooter. The murder occurred while Tippit was investigating a man matching Oswald's description.",
    "featured": true,
    "start_ts": "1963-11-22T13:15:00Z",
    "time_precision": "APPROX"
  },
  {
    "id": "oswald-murder",
    "event_id": "oswald-uuid-1963-11-24",
    "event_type": "SHOT",
    "event_level": "PRIMARY",
    "event_hierarchy": "CATEGORY_1",
    "icon": "gps_fixed",
    "label": "11/24/63 · Dallas, TX",
    "title": "Oswald Murder",
    "location": "Dallas Police Headquarters, Dallas, TX",
    "description": "Jack Ruby murders Lee Harvey Oswald in Dallas Police Headquarters basement",
    "context": "Two days after the JFK assassination, while being transferred from Dallas Police Headquarters, Lee Harvey Oswald was shot and killed by Jack Ruby. The murder was captured live on television and prevented Oswald from standing trial.",
    "featured": true,
    "start_ts": "1963-11-24T11:21:00Z",
    "time_precision": "EXACT"
  },
  {
    "id": "yates-incident",
    "event_id": "1a2b3c4d-5e6f-4a7b-8c9d-0e1f2a3b4c5d",
    "event_type": "SIGHTING",
    "event_level": "PRIMARY",
    "event_hierarchy": "CATEGORY_2",
    "icon": "visibility",
    "label": "11/20/63 · Dallas, TX",
    "title": "The Ralph Yates Incident",
    "location": "Dallas, TX",
    "description": "Ralph Leon Yates reported picking up a hitchhiker, but FBI alibi checks suggest event likely occurred on a different date. Both dates are preserved here for analysis of potential Oswald movements.",
    "context": "The Ralph Yates incident represents one of most compelling witness accounts of a possible Oswald sighting before JFK assassination. Yates, a refrigeration mechanic, reported picking up a hitchhiker matching Oswald's description who carried a package and discussed shooting President from a window. The FBI conducted extensive interviews but ultimately determined discrepancies in Yates' timeline. Yates later experienced a mental health crisis and was hospitalized. The case remains disputed among researchers.",
    "featured": true,
    "is_conflict": true,
    "start_ts": "1963-11-20T10:30:00Z",
    "time_precision": "APPROX"
  },
  {
    "id": "sylvia-odio-incident",
    "event_id": "f1e2d3c4-b5a6-4f7e-8d9c-0a1b2c3d4e5f",
    "event_type": "SIGHTING",
    "event_hierarchy": "CATEGORY_2",
    "event_level": "SECONDARY",
    "icon": "visibility",
    "label": "09/25/63 · Dallas, TX",
    "title": "The Sylvia Odio Incident",
    "display_name": "The Sylvia Odio Incident",
    "location": "Dallas, TX",
    "description": "Three men claiming to be Cuban revolutionaries visited Sylvia Odio's residence, asking for her. One was identified as Lee Harvey Oswald.",
    "context": "Sylvia Odio reported that three men claiming to be from JURE (an anti-Castro organization) visited her Dallas home. Annie Odio answered the door and the men asked for Sylvia. One was identified as 'Leon Oswald' (Lee Harvey Oswald), accompanied by Angelo and Leopoldo. This incident is significant as it places Oswald in Dallas with anti-Castro contacts before the JFK assassination.",
    "featured": true,
    "start_ts": "1963-09-25T00:00:00Z",
    "time_precision": "APPROX"
  }
]
